gordonthree/can-stm32f103-remote/src/main.cpp
#include <Arduino.h>
#include <stdio.h>

#ifdef STMNODE01
#include <IWatchdog.h>
#include <stm32yyxx_ll_adc.h>
// canbus stuff
#include <STM32_CAN.h>
static CAN_message_t CAN_RX_msg;

// setup CAN1 interface using alternate pins
STM32_CAN can1( CAN1, ALT ); // RX_SIZE_64, TX_SIZE_16

#elif TEENSY01
#include <Metro.h>
#include <FlexCAN.h>

Metro sysTimer = Metro(1);// milliseconds

FlexCAN teensycan1(250000, 0);
static CAN_message_t CAN_RX_msg;
#endif

#include <CRC32.h>



// my canbus stuff
#include <canbus_project.h>


// STM32 internal temp sensor stuff
/* Values available in datasheet */
#if defined(STM32C0xx)
#define CALX_TEMP 30
#else
#define CALX_TEMP 25
#endif

#if defined(STM32C0xx)
#define VTEMP      760
#define AVG_SLOPE 2530
#define VREFINT   1212
#elif defined(STM32F1xx)
#define VTEMP     1430
#define AVG_SLOPE 4300
#define VREFINT   1200
#elif defined(STM32F2xx) || defined(STM32F4xx)
#define VTEMP      760
#define AVG_SLOPE 2500
#define VREFINT   1210
#endif

#ifdef STMNODE01 // TODO how do we automate this?
#define LED_BUILTIN PC13
#define LED_ON      0
#define LED_OFF     1

#define CAN_MY_IFACE_TYPE BOX_MULTI_IO
static const uint8_t mySwitchCount = 0; // no switches
static const uint8_t mySensorCount = 3; // got sensors

static const uint8_t* myNodeFeatureMask = FEATURE_BOX_SW_6GANG_HIGH;
#elif TEENSY01
#define LED_BUILTIN 13
#define LED_ON      0
#define LED_OFF     1

#define CAN_MY_IFACE_TYPE BOX_MULTI_IO
static const uint8_t mySwitchCount = 0; // no switches
static const uint8_t mySensorCount = 3; // got sensors

static const uint8_t* myNodeFeatureMask = FEATURE_BOX_SW_6GANG_HIGH;


#endif

/* Analog read resolution */
#define LL_ADC_RESOLUTION LL_ADC_RESOLUTION_12B
#define ADC_RANGE 4096

float Temperature, V_Sense, V_Ref;
char TxBuffer[30];
uint16_t AD_RES[2];
#ifdef STMNODE01
ADC_HandleTypeDef hadc1;
#endif
// 32-bit CRC calculation library
CRC32 crc;


// Interval:
uint16_t TRANSMIT_RATE_MS = 1000;
#define POLLING_RATE_MS 500




struct outputSwitch nodeSwitch[8]; // list of switches
struct outputSensor nodeSensor[8]; // list of sensors

unsigned long previousMillis = 0;  // will store last time a message was send

volatile uint8_t nodeSwitchState[8] = {0, 0, 0, 0, 0, 0, 0, 0};  // switch state
volatile uint8_t nodeSwitchMode[8]  = {0, 0, 0, 0, 0, 0, 0, 0};  // switch mode

volatile uint16_t introMsg[8]       = {0, 0, 0, 0, 0, 0, 0, 0};  // intro messages  
volatile uint8_t  introMsgPtr       = 0;                         // intro message pointer
volatile uint8_t  introMsgData[8]   = {0, 0, 0, 0, 0, 0, 0, 0};  // intro message data
volatile uint8_t  introMsgCnt       = 0;                         // intro message count

volatile static uint8_t myNodeID[] = {0, 0, 0, 0}; // node ID

void getmyNodeID(){
  uint32_t UID[3];

  #ifdef STMNODE01
  // get unique hardware id from HAL
  UID[0] = HAL_GetUIDw0();
  UID[1] = HAL_GetUIDw1();
  UID[2] = HAL_GetUIDw2();
  #endif
  // show the user
  // Serial.printf("UID: %08x:%08x:%08x\n", UID[0], UID[1], UID[2]);

  // add UID values to CRC calulation library
  crc.add(UID[0]);
  crc.add(UID[1]);
  crc.add(UID[2]);

  // show the user
  // Serial.printf("CRC %08x\n", crc.calc());

  // calculate 32-bit crc value from the uid
  int myCRC = crc.calc();

  // transfer those four bytes to myNodeID array
  myNodeID[0] = (myCRC >> 24) & 0xFF; // get first byte of CRC
  myNodeID[1] = (myCRC >> 16) & 0xFF; // get second byte of CRC
  myNodeID[2] = (myCRC >> 8) & 0xFF;  // get third byte of CRC
  myNodeID[3] = myCRC & 0xFF;         // get fourth byte of CRC

  // show the user
  Serial.printf("\nSTM32 CAN Remote\nNode ID: %02x:%02x:%02x:%02x\n\n", myNodeID[0], myNodeID[1], myNodeID[2], myNodeID[3]);
}

// convert byte array into 32-bit integer
static uint32_t unchunk32(const uint8_t* dataBytes){
  static uint32_t result = ((dataBytes[0]<<24) | (dataBytes[1]<<16) | (dataBytes[2]<<8) | (dataBytes[3]));

  return result;
}
// convert a 32-bit number into a 4 byte array
char* chunk32(const uint32_t inVal = 0) {
  static char tempStr[4] = {(inVal >> 24) && 0xFF, (inVal >> 16) && 0xFF, (inVal >>  8) && 0xFF, inVal && 0xFF};
  return tempStr;
}

#ifndef TEENSY01
static int32_t readVref() {
#ifdef STM32U0xx
  /* On some devices Internal voltage reference calibration value not programmed
     during production and return 0xFFFF. See errata sheet. */
  if ((uint32_t)(*VREFINT_CAL_ADDR) == 0xFFFF) {
    return 3300U;
  }
#endif
#ifdef __LL_ADC_CALC_VREFANALOG_VOLTAGE
#ifdef STM32U5xx
  return (__LL_ADC_CALC_VREFANALOG_VOLTAGE(ADC1, analogRead(AVREF), LL_ADC_RESOLUTION));
#else
  return (__LL_ADC_CALC_VREFANALOG_VOLTAGE(analogRead(AVREF), LL_ADC_RESOLUTION));
#endif
#else
  return (VREFINT * ADC_RANGE / analogRead(AVREF)); // ADC sample to mV
#endif
}
#endif

#ifdef ATEMP
static int32_t readTempSensor(int32_t VRef) {
#ifdef __LL_ADC_CALC_TEMPERATURE
#ifdef STM32U5xx
  return (__LL_ADC_CALC_TEMPERATURE(ADC1, VRef, analogRead(ATEMP), LL_ADC_RESOLUTION));
#else
  return (__LL_ADC_CALC_TEMPERATURE(VRef, analogRead(ATEMP), LL_ADC_RESOLUTION));
#endif
#elif defined(__LL_ADC_CALC_TEMPERATURE_TYP_PARAMS)
  return (__LL_ADC_CALC_TEMPERATURE_TYP_PARAMS(AVG_SLOPE, VTEMP, CALX_TEMP, VRef, analogRead(ATEMP), LL_ADC_RESOLUTION));
#else
  return 0;
#endif
}
#endif

#ifndef TEENSY01
static int32_t readVoltage(int32_t VRef, uint32_t pin)
{
#ifdef STM32U5xx
  return (__LL_ADC_CALC_DATA_TO_VOLTAGE(ADC1, VRef, analogRead(pin), LL_ADC_RESOLUTION));
#else
  return (__LL_ADC_CALC_DATA_TO_VOLTAGE(VRef, analogRead(pin), LL_ADC_RESOLUTION));
#endif
}
#endif

// print list of switches and their attributes to the web console
static void dumpSwitches() {
  Serial.println("\n\n--------------------------------------------------------------------------\n");

  Serial.println("Switches:\n\n");
  for (int i = 0; i < mySwitchCount; i++) {
    Serial.printf("Switch %d: Last Update: %d\n", i, nodeSwitch[i].lastSeen);
      
    Serial.printf("State %d, Mode %d, Type %d, Feature Mask %02x:%02x\n",  
      nodeSwitch[i].swState,
      nodeSwitch[i].swMode,
      nodeSwitch[i].swType,
      nodeSwitch[i].featuresMask[0],
      nodeSwitch[i].featuresMask[1]);
      
    Serial.printf("pwmDuty %d, pwmFreq %d, blinkDelay %d, momPressDur %d, strobePat %d\n\n",
      nodeSwitch[i].pwmDuty,
      nodeSwitch[i].pwmFreq,
      nodeSwitch[i].blinkDelay,
      nodeSwitch[i].momPressDur,
      nodeSwitch[i].strobePat);
      
