gordonthree/can-stm32f103-remote/src/main.cpp
      delay(5);
  }
  Serial.println("\n\nEnd of Switches\n");
  Serial.println("--------------------------------------------------------------------------\n\n");

}

static void send_message(const uint16_t msgID, const uint8_t *msgData, const uint8_t dlc) {
  CAN_message_t message;
  // static uint8_t dataBytes[] = {0, 0, 0, 0, 0, 0, 0, 0}; // initialize dataBytes array with 8 bytes of 0

  digitalWrite(LED_BUILTIN, LED_ON);

  #ifdef STMNODE01
  // Format message
  message.id             = msgID;                                      // set message ID
  message.flags.extended = STD;                                        // 0 = standard frame, 1 = extended frame
  message.flags.remote   = 0;                                          // 0 = data frame, 1 = remote frame
  message.len            = dlc;                                        // data length code (0-8 bytes)
  #elif TEENSY01
  // Format message
  message.id             = msgID;                                      // set message ID
  message.len            = dlc;                                        // data length code (0-8 bytes)
  #endif
  
  memcpy(message.buf, (const uint8_t*) msgData, dlc);                  // copy data to message data field 

  #ifdef STMNODE01
  // Queue message for transmission
  if (can1.write(message)) {  // send message to bus, true = wait for empty mailbox
    // successful write?
  #elif TEENSY01
  // Queue message for transmission
  if (teensycan1.write(message)) {  // send message to bus, true = wait for empty mailbox
    // successful write?

  #endif
  } else {
    Serial.printf("ERR: Failed to queue message\n");
  }

  digitalWrite(LED_BUILTIN, LED_OFF);

}

static void rxSwMomDur(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint16_t swDuration = (data[5] << 8) | data[6]; // duration in ms
  
  nodeSwitch[switchID].momPressDur = swDuration; // update momentary press duration
}

static void rxSwBlinkDelay(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint16_t swBlinkDelay = (data[5] << 8) | data[6]; // delay in ms 

  nodeSwitch[switchID].blinkDelay = swBlinkDelay; // update blink delay
}

static void rxSwStrobePat(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint8_t swStrobePat = data[5]; // strobe pattern

  nodeSwitch[switchID].strobePat = swStrobePat; // update strobe pattern
}

static void rxPWMDuty(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint16_t PWMDuty = (data[5] << 8) | data[6]; // pwm duty cycle

  nodeSwitch[switchID].pwmDuty = PWMDuty; // update pwm duty cycle
}

static void rxPWMFreq(uint8_t *data) {
  static uint8_t switchID = data[4]; // switch ID 
  static uint16_t PWMFreq = (data[5] << 8) | data[6]; // pwm frequency 

  nodeSwitch[switchID].pwmFreq = PWMFreq; // update pwm frequency
}

static void rxSwitchState(const uint8_t *data, const uint8_t swState) {
  uint8_t switchID = data[4]; // switch ID 
  // static uint8_t unitID[] = {data[0], data[1], data[2], data[3]}; // unit ID
  uint8_t dataBytes[] = {myNodeID[0], myNodeID[1], myNodeID[2], myNodeID[3], switchID}; // send my own node ID, along with the switch number

  // Serial.printf("RX: Set Switch %d State %d\n", switchID, swState);
  // nodeSwitchState[switchID] = swState; // update switch buffer
  nodeSwitch[switchID].swState = swState; // update switch buffer
  // nodeSwitch[switchID].lastSeen = getEpoch(); // update last seen time
  

  switch (swState) {
    case 0: // switch off
      // send_message(DATA_OUTPUT_SWITCH_OFF, dataBytes, sizeof(dataBytes));
      break;
    case 1: // switch on
      // send_message(DATA_OUTPUT_SWITCH_ON, dataBytes, sizeof(dataBytes));
      break;
    case 2: // momentary press
      // send_message(DATA_OUTPUT_SWITCH_MOM_PUSH , dataBytes, sizeof(dataBytes));
      // send_message(DATA_OUTPUT_SWITCH_ON, dataBytes, sizeof(dataBytes));
      // send_message(DATA_OUTPUT_SWITCH_OFF, dataBytes, sizeof(dataBytes));
      break;
    default:
      Serial.println("Invalid switch state");
      break;
  }
}

static void rxSwitchMode(const uint8_t *data) {
  uint8_t switchID = data[4]; // switch ID 
  uint8_t switchMode = data[5]; // switch mode

  uint8_t dataBytes[] = {myNodeID[0], myNodeID[1], myNodeID[2], myNodeID[3], switchID, switchMode}; // send my own node ID, along with the switch number

  Serial.printf("RX: Set Switch %d Mode %d\n", switchID, switchMode);
  // send_message(DATA_OUTPUT_SWITCH_MODE, dataBytes, sizeof(dataBytes));    
  // nodeSwitchMode[switchID] = switchMode; // update switch mode
  nodeSwitch[switchID].swMode = switchMode; // update switch mode
  // nodeSwitch[switchID].lastSeen = getEpoch(); // update last seen time


  switch (switchMode) {
    case 0: // solid state (on/off)
      break;  
    case 1: // one-shot momentary
      break;
    case 2: // blinking
      break;
    case 3: // strobing
      break;
    case 4: // pwm
      break;
    case 5: // disabled
      break;
    default:
      Serial.println("Invalid switch mode");
      break;
  }
}

// send an introduction message to the bus
// static void txIntroduction(const uint8_t* txNodeID, const uint8_t* txNodeFeatureMask, const uint_8t txMsgData, const uint16_t txmsgID, const uint8_t ptr) {
static void txIntroduction(uint8_t* txNodeID, uint8_t* txNodeFeatureMask, uint8_t txMsgData, uint16_t txmsgID, uint8_t ptr) {
  
  if (txmsgID < 1) {
    // Serial.printf("RX: INTRO ACK NULL\n");
    return; // exit function if message ID is null
  }

  Serial.printf("TX: INTRO PTR %d ", ptr);  // message pointer
  Serial.printf("ID %02x:%02x:%02x:%02x ", txNodeID[0], txNodeID[1], txNodeID[2], txNodeID[3]); // node 
  Serial.printf("MSG %03x\n", txmsgID); // message ID


  if (ptr == 0) {
    uint8_t dataBytes[6] = { txNodeID[0], txNodeID[1], txNodeID[2], txNodeID[3], 
                              txNodeFeatureMask[0], txNodeFeatureMask[1] }; 

    send_message(txmsgID, dataBytes, 6);
  } else {
    uint8_t dataBytes[5] = { txNodeID[0], txNodeID[1], txNodeID[2], txNodeID[3], txMsgData }; 

    send_message(txmsgID, dataBytes, 5);
  }
}

