gordonthree/can-stm32f103-remote/src/main.cpp
  Serial.print("Loading JSON into memory... ");

  for (int i = 0; i <= 7; i++) {
    String currentKey = String(i); // Keys are strings: "0", "1", ...

    // Use doc[currentKey].is<JsonArray>() instead of containsKey()
    if (doc[currentKey].is<JsonArray>()) {
      JsonArray currentArray = doc[currentKey].as<JsonArray>();

      nodeSwitch[i].swState = currentArray[0]; // Set switch state
      nodeSwitch[i].swMode = currentArray[1]; // Set switch mode
      nodeSwitch[i].swType = currentArray[2]; // Set switch type
      nodeSwitch[i].featuresMask[0] = currentArray[3]; // Set feature mask byte 1
      nodeSwitch[i].featuresMask[1] = currentArray[4]; // Set feature mask byte 2
      nodeSwitch[i].pwmDuty = currentArray[5]; // Set PWM duty cycle
      nodeSwitch[i].pwmFreq = currentArray[6]; // Set PWM frequency
      nodeSwitch[i].blinkDelay = currentArray[7]; // Set blink delay
      nodeSwitch[i].momPressDur = currentArray[8]; // Set momentary press duration
      nodeSwitch[i].strobePat = currentArray[9]; // Set strobe pattern
      nodeSwitch[i].stateMemory = currentArray[10]; // Set state memory
      nodeSwitch[i].lastSeen = currentArray[11]; // Set last seen time

    }
  }
  Serial.println("Finished!\n.\n"); */
}



void recvMsg(uint8_t *data, size_t len){
  Serial.println("Received Data...");
  String d = "";
  for(int i=0; i < len; i++){
    d += char(data[i]);
  }
  Serial.println(d);

  if (d == "C0"){
    // vTaskSuspend(canbus_task_handle); // suspend canbus task
    // digitalWrite(LED, HIGH);
  }
  if (d == "C1"){
    // vTaskResume(canbus_task_handle); // resume canbus task
    // digitalWrite(LED, HIGH);
  }
  if (d == "W"){
    // printWifi();
    // digitalWrite(LED, HIGH);
  }

  if (d == "LOAD"){
    // vTaskSuspend(canbus_task_handle); // suspend canbus task
    loadJSONConfig();
    // vTaskSuspend(canbus_task_handle); // suspend canbus task
    // digitalWrite(LED, HIGH);
  }

  if (d == "TIME"){
    // printEpoch();
    // digitalWrite(LED, HIGH);
  }

  if (d == "FAST"){
   TRANSMIT_RATE_MS = 1000;
    Serial.printf("\nTX Rate: %d ms\n", TRANSMIT_RATE_MS);
    // digitalWrite(LED, HIGH); 
  }

  if (d == "FSTR"){
    TRANSMIT_RATE_MS = TRANSMIT_RATE_MS - 250;
     Serial.printf("\nTX Rate: %d ms\n", TRANSMIT_RATE_MS);
     // digitalWrite(LED, HIGH); 
   }

  if (d == "SLOW"){
    TRANSMIT_RATE_MS = 4000;
    Serial.printf("\nTX Rate: %d ms\n", TRANSMIT_RATE_MS);
    // digitalWrite(LED, HIGH); 
  }


  if (d == "RESTART"){
    Serial.println("Restarting...");
    // ESP.restart();
    // digitalWrite(LED, HIGH);
  }

  if (d == "NODEID"){
    Serial.printf("Node ID: %02x:%02x:%02x:%02x\n", myNodeID[0], myNodeID[1], myNodeID[2], myNodeID[3]);
    // digitalWrite(LED, HIGH);
  }
    
  if (d=="LIST"){
    dumpSwitches();
    // dumpNodeList();
    // digitalWrite(LED, LOW);
  }
  if (d == "ON"){
    FLAG_BEGIN_NORMAL_OPER = true; // flag to start normal operation
  }
  if (d=="OFF"){
    FLAG_BEGIN_NORMAL_OPER = false; // clear flag for normal operation
  }
}




void setup() {
  #ifdef STMNODE01 // TODO how do we automate this?

  nodeSensor[0].present    = true;
  nodeSensor[0].sensorType = NODE_INT_VOLTAGE_SENSOR;
  nodeSensor[0].sensorMsg  = DATA_INTERNAL_PCB_VOLTS;
  nodeSensor[0].dataSize   = DATA_SIZE_16BITS;
  nodeSensor[1].present    = true;
  nodeSensor[1].sensorType = NODE_CPU_TEMP;
  nodeSensor[1].sensorMsg  = DATA_NODE_CPU_TEMP;
  nodeSensor[1].dataSize   = DATA_SIZE_16BITS;
  nodeSensor[2].present    = true;
  nodeSensor[2].sensorType = BUTTON_ANALOG_KNOB;
  nodeSensor[2].sensorMsg  = SENSOR_RESERVED_72C;
  nodeSensor[2].dataSize   = DATA_SIZE_16BITS;

  introMsgCnt = 4; // number of intro messages
  introMsgPtr = 0; // start at zero
  introMsg[0] = (uint16_t) BOX_MULTI_IO; // generic multi io box
  introMsg[1] = nodeSensor[0].sensorType; // intro message for high current switch
  introMsg[2] = nodeSensor[1].sensorType; // intro message for low current switch
  introMsg[3] = nodeSensor[2].sensorType; // intro message for CPU temperature
  
  introMsgData[0] = 0; // send feature mask
  introMsgData[1] = 1; // one of these
  introMsgData[2] = 1; // one of these
  introMsgData[3] = 1; // and one of these

  #elif STMNODE02
  introMsgCnt = 3; // number of intro messages
  introMsgPtr = 0; // start at zero
  introMsg[0] = (uint16_t) BOX_SW_4GANG; // intro message for 4 relay switch box
  introMsg[1] = (uint16_t) OUT_HIGH_CURRENT_SW; // intro message for high current switch
  introMsg[2] = (uint16_t) OUT_LOW_CURRENT_SW; // intro message for low current switch

  introMsgData[0] = 0; // send feature mask
  introMsgData[1] = 2; // two high current switches
  introMsgData[2] = 2; // two low current switches
  #endif

#ifndef TEENSY01
  // setup hardware timer to send data in 50Hz pace
#if defined(TIM1)
  TIM_TypeDef *Instance = TIM1;
#else
  TIM_TypeDef *Instance = TIM2;
#endif
  HardwareTimer *SendTimer = new HardwareTimer(Instance);
  SendTimer->setOverflow(1, HERTZ_FORMAT); // 50 Hz
#if ( STM32_CORE_VERSION_MAJOR < 2 )
  SendTimer->attachInterrupt(1, SendData);
  SendTimer->setMode(1, TIMER_OUTPUT_COMPARE);
#else //2.0 forward
  SendTimer->attachInterrupt(nodeCheckStatus);
#endif
#endif

  analogReadResolution(12);

  pinMode(LED_BUILTIN, OUTPUT); // blue pill LED
  Serial.begin(256000);
  delay(5000);
  #ifdef STMNODE01
  can1.begin(); // begin CAN bus with no auto retransmission
  can1.setBaudRate(250000);  //250KBPS
  // can1.setMBFilter(ACCEPT_ALL); // accept all messages
  // can1.enableLoopBack(false); // disable loopback mode
  // can1.enableFIFO(false); // enable FIFO mode

  can1.setMBFilterProcessing( MB0, MSG_CTRL_SWITCHES, 0x780, STD ); // 0x780 watch the four MSB of the ID 
  can1.setMBFilterProcessing( MB1, MSG_REQ_INTRO, 0x780, STD );

  getmyNodeID(); // get node ID from UID
  FLAG_SEND_INTRODUCTION = true;
  SendTimer->resume();
  #elif TEENSY01
  teensycan1.begin();
  CAN_filter_t myFilter = {.id = (MSG_CTRL_IFACE<<21) | (MASK_CTRL_IFACE <<5)};
  

  //teensycan1.setFilter()
  #endif


} // end setup

int lastPending = 0;
uint32_t last = 0;
int lastMillis = 0;


void loop() {


  if ((millis() - lastMillis) > TRANSMIT_RATE_MS) {
    lastMillis = millis();
    // Serial.print(".");
    // digitalToggle(LED_BUILTIN); // toggle LED
    
    nodeCheckStatus(); // handle node status
    
    #ifdef STMNODE01
    // Print out the value read
    int32_t VRef = readVref();                       // get the voltage reference value
    nodeSensor[0].i32Value = VRef;                   // store vref reading
    nodeSensor[1].i32Value = readTempSensor(VRef);   // store cpu temp reading
    nodeSensor[2].i32Value = readVoltage(VRef, A0);  // store value of analog 0
    #endif
  }

  #ifdef STMNODE01
  while (can1.read(CAN_RX_msg) ) {
    // Serial.printf("RX: MSG: %03x DATA: %u\n", CAN_RX_msg.id, CAN_RX_msg.len);
    handle_rx_message(CAN_RX_msg); // handle received message}
  }
  #endif

} // end of loop